In [1]:
import pandas as pd

In [2]:
x = pd.read_excel("Student_data.xlsx")

In [3]:
x

     Name  Class Seaction    City   Mobile No          Email Id
0     Raj      5        A    Agra  4525943587     Raj@gmail.com
1  Aakash      8        C   Delhi  5789256418  Aakash@gmcil.com
2     Ram      4        A    Pune  3154687219     Ram@gmail.com
3   Shyam     11        B  Indore  6493587524   Shyam@gmbil.com
4   Nitin     12        C  Mumbai  6416231125   Nitin@gmcil.com

In [4]:
x.columns

Index(['Name', 'Class', 'Seaction', 'City', 'Mobile No', 'Email Id'], dtype='object')

In [5]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
x.values

array([['Raj', 5, 'A', 'Agra', 4525943587, 'Raj@gmail.com'],
       ['Aakash', 8, 'C', 'Delhi', 5789256418, 'Aakash@gmcil.com'],
       ['Ram', 4, 'A', 'Pune', 3154687219, 'Ram@gmail.com'],
       ['Shyam', 11, 'B', 'Indore', 6493587524, 'Shyam@gmbil.com'],
       ['Nitin', 12, 'C', 'Mumbai', 6416231125, 'Nitin@gmcil.com']],
      dtype=object)

In [7]:
x.shape

(5, 6)

In [8]:
x.size

30

In [9]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       5 non-null      object
 1   Class      5 non-null      int64
 2   Seaction   5 non-null      object
 3   City       5 non-null      object
 4   Mobile No  5 non-null      int64
 5   Email Id   5 non-null      object
dtypes: int64(2), object(4)
memory usage: 368.0+ bytes

In [10]:
x["Name"]

0       Raj
1    Aakash
2       Ram
3     Shyam
4     Nitin
Name: Name, dtype: object

In [11]:
subset = x[["Name","City","Email Id"]]

In [12]:
subset

     Name    City          Email Id
0     Raj    Agra     Raj@gmail.com
1  Aakash   Delhi  Aakash@gmcil.com
2     Ram    Pune     Ram@gmail.com
3   Shyam  Indore   Shyam@gmbil.com
4   Nitin  Mumbai   Nitin@gmcil.com

In [13]:
x.loc[4]

Name                   Nitin
Class                     12
Seaction                   C
City                  Mumbai
Mobile No         6416231125
Email Id     Nitin@gmcil.com
Name: 4, dtype: object

In [14]:
x.loc[[1,3]]

     Name  Class Seaction    City   Mobile No          Email Id
1  Aakash      8        C   Delhi  5789256418  Aakash@gmcil.com
3   Shyam     11        B  Indore  6493587524   Shyam@gmbil.com

In [15]:
x

     Name  Class Seaction    City   Mobile No          Email Id
0     Raj      5        A    Agra  4525943587     Raj@gmail.com
1  Aakash      8        C   Delhi  5789256418  Aakash@gmcil.com
2     Ram      4        A    Pune  3154687219     Ram@gmail.com
3   Shyam     11        B  Indore  6493587524   Shyam@gmbil.com
4   Nitin     12        C  Mumbai  6416231125   Nitin@gmcil.com

In [16]:
x.iloc[4]

Name                   Nitin
Class                     12
Seaction                   C
City                  Mumbai
Mobile No         6416231125
Email Id     Nitin@gmcil.com
Name: 4, dtype: object

In [17]:
x.iloc[[1,3]]

     Name  Class Seaction    City   Mobile No          Email Id
1  Aakash      8        C   Delhi  5789256418  Aakash@gmcil.com
3   Shyam     11        B  Indore  6493587524   Shyam@gmbil.com

In [20]:
subset = x.loc[:,["Name","Mobile No"]]

In [21]:
subset

     Name   Mobile No
0     Raj  4525943587
1  Aakash  5789256418
2     Ram  3154687219
3   Shyam  6493587524
4   Nitin  6416231125

In [ ]:
x.loc[x["Seaction"] == "A",["Name","Email Id"]]

# Add multiple conditions ues ==> &

In [27]:
x.loc[(x["Seaction"] == "A") & (x["City"] == "Pune"),["Name","Email Id"]]

  Name       Email Id
2  Ram  Ram@gmail.com